#include "sys.h"

//////////////////////////////////////////////////////////////////////////////////	 
//LED驱动代码	   											  
////////////////////////////////////////////////////////////////////////////////// 	   
void LED_Init(void)
{
	RCC->APB2ENR|=1<<4;//先使能外设IO PORTC时钟 	
	GPIOC->CRL&=0XFFFF000F;
	GPIOC->CRL|=0X00003330; //PC1PC2PC3输出	
	RUN_LED = 1;
	FAULE_LED = 1;
	POWER_LED = 0;
}
	
//串口1发送数据
void USART1_send(u8 *buf,u8 len)
{
	u8 i;
	for(i=0;i<len;i++)
	{
		USART1->DR=buf[i];
		while((USART1->SR&0X40)==0);//等待发送结束
	}
}
/************************************************
函数：void LED_USART(u8 t)
说明：对串口1接受的数据进行处理，
入参：串口数据 res
返回：无
*************************************************/
void LED_USART(u8 res)
{

}










